<abi-corpus-group architecture='elf-arm-aarch64'>
  <abi-corpus path='vmlinux' architecture='elf-arm-aarch64'>
    <elf-function-symbols>
      <elf-symbol name='__kfifo_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x139f2189'/>
      <elf-symbol name='__kfifo_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xdb760f52'/>
      <elf-symbol name='__kfifo_from_user' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x30a80826'/>
      <elf-symbol name='__kfifo_in' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xf23fcb99'/>
      <elf-symbol name='__kfifo_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xbd462b55'/>
      <elf-symbol name='__kfifo_out' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x13d0adf7'/>
      <elf-symbol name='__kfifo_out_peek' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x281823c5'/>
      <elf-symbol name='__kfifo_to_user' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4578f528'/>
      <elf-symbol name='__scsi_iterate_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x7e134d4c'/>
      <elf-symbol name='access_process_vm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xe4588f33'/>
      <elf-symbol name='class_create_file_ns' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc2a8140d'/>
      <elf-symbol name='class_remove_file_ns' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x85adc055'/>
      <elf-symbol name='devm_snd_soc_register_component' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x16c80f20'/>
      <elf-symbol name='filp_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5a14eb10'/>
      <elf-symbol name='filp_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd77f7f3c'/>
      <elf-symbol name='find_get_pid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x53920685'/>
      <elf-symbol name='find_vpid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x91c6226d'/>
      <elf-symbol name='get_pid_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x19c85d4a'/>
      <elf-symbol name='get_task_mm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x27e368db'/>
      <elf-symbol name='i2c_smbus_read_byte_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x58c51172'/>
      <elf-symbol name='i2c_smbus_read_i2c_block_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xf9695018'/>
      <elf-symbol name='i2c_smbus_write_byte_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xda462c5e'/>
      <elf-symbol name='i2c_smbus_write_i2c_block_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x405115f4'/>
      <elf-symbol name='keyslot_manager_set_max_dun_bytes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xfbb99950'/>
      <elf-symbol name='kstrtoull_from_user' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x54245b39'/>
      <elf-symbol name='mmput' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xae27043b'/>
      <elf-symbol name='of_get_next_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4e667277'/>
      <elf-symbol name='pid_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5cd903ac'/>
      <elf-symbol name='power_supply_is_system_supplied' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2c208607'/>
      <elf-symbol name='power_supply_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc651fa29'/>
      <elf-symbol name='power_supply_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x9c322a2c'/>
      <elf-symbol name='put_pid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xaf908193'/>
      <elf-symbol name='round_jiffies_relative' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1eb9516e'/>
      <elf-symbol name='sched_show_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x8fb34bb8'/>
      <elf-symbol name='test_taint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x651a4139'/>
      <elf-symbol name='wakeup_source_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x34d1cf61'/>
      <elf-symbol name='wakeup_source_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6beba47a'/>
      <elf-symbol name='wakeup_source_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x12f12ea6'/>
      <elf-symbol name='wakeup_source_remove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2b916687'/>
    </elf-function-symbols>
    <elf-variable-symbols>
      <elf-symbol name='console_printk' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2592fc6c'/>
      <elf-symbol name='init_task' size='3840' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4f7f52cf'/>
    </elf-variable-symbols>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' language='LANG_C89'>
      <class-decl name='module' is-struct='yes' visibility='default' is-declaration-only='yes' id='29476915'/>
      <array-type-def dimensions='1' type-id='cb92d198' size-in-bits='infinite' id='5e2617b4'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='128' id='49580a63'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <class-decl name='keyslot_mgmt_ll_ops' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/keyslot-manager.h' line='40' column='1' id='c1dff252'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='keyslot_program' type-id='ca0ebd68' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/keyslot-manager.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='keyslot_evict' type-id='ca0ebd68' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/keyslot-manager.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='derive_raw_secret' type-id='d704caf9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/keyslot-manager.h' line='47' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='keyslot' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='36' column='1' id='cb92d198'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='slot_refs' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='idle_slot_node' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='hash_node' type-id='03a4a074' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='key' type-id='7b61b7b4' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='40' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='f9b06939' const='yes' id='19272f09'/>
      <pointer-type-def type-id='19272f09' size-in-bits='64' id='bbaf3419'/>
      <pointer-type-def type-id='6fcc679e' size-in-bits='64' id='ca0ebd68'/>
      <pointer-type-def type-id='120580bd' size-in-bits='64' id='d704caf9'/>
      <pointer-type-def type-id='29476915' size-in-bits='64' id='2730d015'/>
      <pointer-type-def type-id='f9b06939' size-in-bits='64' id='8bff8096'/>
      <function-decl name='keyslot_manager_set_max_dun_bytes' mangled-name='keyslot_manager_set_max_dun_bytes' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='keyslot_manager_set_max_dun_bytes'>
        <parameter type-id='6e3684aa' name='ksm' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='219' column='1'/>
        <parameter type-id='f0981eeb' name='max_dun_bytes' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/block/keyslot-manager.c' line='220' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-type size-in-bits='64' id='6fcc679e'>
        <parameter type-id='6e3684aa'/>
        <parameter type-id='9baaf905'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='120580bd'>
        <parameter type-id='6e3684aa'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' language='LANG_C89'>
      <function-decl name='wakeup_source_create' mangled-name='wakeup_source_create' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wakeup_source_create'>
        <parameter type-id='80f4b756' name='name' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='87' column='1'/>
        <return type-id='1ea237a6'/>
      </function-decl>
      <function-decl name='wakeup_source_destroy' mangled-name='wakeup_source_destroy' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wakeup_source_destroy'>
        <parameter type-id='1ea237a6' name='ws' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='159' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='wakeup_source_add' mangled-name='wakeup_source_add' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wakeup_source_add'>
        <parameter type-id='1ea237a6' name='ws' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='174' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='wakeup_source_remove' mangled-name='wakeup_source_remove' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wakeup_source_remove'>
        <parameter type-id='1ea237a6' name='ws' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/power/wakeup.c' line='195' column='1'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/base/regmap/regmap-i2c.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='272' id='ba592c87'>
        <subrange length='34' type-id='7ff19f0f' id='6a6a7e00'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
        <subrange length='20' type-id='7ff19f0f' id='fdca39cf'/>
      </array-type-def>
      <class-decl name='cred' is-struct='yes' visibility='default' is-declaration-only='yes' id='6739dd09'/>
      <class-decl name='gpio_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='63b74212'/>
      <class-decl name='irq_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='064acd7a'/>
      <class-decl name='irq_domain_chip_generic' is-struct='yes' visibility='default' is-declaration-only='yes' id='f100815b'/>
      <class-decl name='nsproxy' is-struct='yes' visibility='default' is-declaration-only='yes' id='b82b9d3a'/>
      <class-decl name='signal_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='9a4619bf'/>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='512' id='02fdec64'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='infinite' id='c764d637'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <class-decl name='i2c_client' size-in-bits='7808' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='313' column='1' id='a9cdb48b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='314' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='addr' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='324' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='name' type-id='664ac0b7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='327' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='adapter' type-id='b9af02c3' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='328' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='329' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7616'>
          <var-decl name='init_irq' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='330' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7648'>
          <var-decl name='irq' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='331' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7680'>
          <var-decl name='detected' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='332' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='i2c_adapter' size-in-bits='9600' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='685' column='1' id='ec5384d3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='owner' type-id='2730d016' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='686' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='class' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='687' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='algo' type-id='e93ce0cc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='688' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='algo_data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='689' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='lock_ops' type-id='16d08491' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='692' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='bus_lock' type-id='dd823037' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='693' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='mux_lock' type-id='dd823037' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='694' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='timeout' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='696' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='864'>
          <var-decl name='retries' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='697' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='698' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8256'>
          <var-decl name='locked_flags' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='699' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8320'>
          <var-decl name='nr' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='703' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8352'>
          <var-decl name='name' type-id='36d7f119' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='704' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8768'>
          <var-decl name='dev_released' type-id='f9fef04f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='705' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9024'>
          <var-decl name='userspace_clients_lock' type-id='925167dc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='707' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9280'>
          <var-decl name='userspace_clients' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='708' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9408'>
          <var-decl name='bus_recovery_info' type-id='f1537b61' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='710' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9472'>
          <var-decl name='quirks' type-id='398e6008' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='711' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9536'>
          <var-decl name='host_notify_domain' type-id='7544e824' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='713' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='i2c_algorithm' size-in-bits='320' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='526' column='1' id='547b1199'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='master_xfer' type-id='4813c4da' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='536' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='master_xfer_atomic' type-id='4813c4da' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='538' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='smbus_xfer' type-id='99dc8ee7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='540' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='smbus_xfer_atomic' type-id='99dc8ee7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='543' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='functionality' type-id='d0ff2b97' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='548' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='i2c_msg' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='69' column='1' id='56ed3a25'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='addr' type-id='d315442e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='flags' type-id='d315442e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='len' type-id='d315442e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='buf' type-id='474e5dcc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='85' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='i2c_smbus_data' size-in-bits='272' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='135' column='1' id='1a96c066'>
        <data-member access='private'>
          <var-decl name='byte' type-id='8f048e17' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='136' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='word' type-id='d315442e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='137' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='block' type-id='ba592c87' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/linux/i2c.h' line='138' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='i2c_lock_operations' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='564' column='1' id='a94a041a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock_bus' type-id='6523d744' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='565' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='trylock_bus' type-id='3d5afe0d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='unlock_bus' type-id='6523d744' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='567' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='rt_mutex' size-in-bits='256' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/rtmutex.h' line='30' column='1' id='dd823037'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='wait_lock' type-id='f5c90b3f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/rtmutex.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='waiters' type-id='6fe1603d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/rtmutex.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='owner' type-id='f23e2572' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/rtmutex.h' line='33' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='irq_domain_ops' size-in-bits='640' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='105' column='1' id='0926e4bd'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='match' type-id='f1c95c76' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='select' type-id='e1759090' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='map' type-id='8a2b0cc8' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='unmap' type-id='8b74557f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='111' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='xlate' type-id='7881e15c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='112' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='alloc' type-id='0871ecbc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='117' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='free' type-id='644a4b55' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='119' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='activate' type-id='7ad47ca2' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='deactivate' type-id='0b8fca52' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='translate' type-id='bbe45043' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='123' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='irq_domain_bus_token' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='77' column='1' id='385b8018'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='DOMAIN_BUS_ANY' value='0'/>
        <enumerator name='DOMAIN_BUS_WIRED' value='1'/>
        <enumerator name='DOMAIN_BUS_GENERIC_MSI' value='2'/>
        <enumerator name='DOMAIN_BUS_PCI_MSI' value='3'/>
        <enumerator name='DOMAIN_BUS_PLATFORM_MSI' value='4'/>
        <enumerator name='DOMAIN_BUS_NEXUS' value='5'/>
        <enumerator name='DOMAIN_BUS_IPI' value='6'/>
        <enumerator name='DOMAIN_BUS_FSL_MC_MSI' value='7'/>
        <enumerator name='DOMAIN_BUS_TI_SCI_INTA_MSI' value='8'/>
        <enumerator name='DOMAIN_BUS_WAKEUP' value='9'/>
      </enum-decl>
      <class-decl name='irq_fwspec' size-in-bits='640' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='64' column='1' id='a87c488a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='param_count' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='param' type-id='02fdec64' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/irqdomain.h' line='67' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='irq_hw_number_t' type-id='7359adad' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='169' column='1' id='88370ce9'/>
      <class-decl name='i2c_bus_recovery_info' size-in-bits='640' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='611' column='1' id='d5526a99'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='recover_bus' type-id='6ae2afd7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='612' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='get_scl' type-id='6ae2afd7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='614' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='set_scl' type-id='8f19938d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='615' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='get_sda' type-id='6ae2afd7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='616' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='set_sda' type-id='8f19938d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='617' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='get_bus_free' type-id='6ae2afd7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='618' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='prepare_recovery' type-id='8616a4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='620' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='unprepare_recovery' type-id='8616a4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='621' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='scl_gpiod' type-id='26760480' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='624' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='sda_gpiod' type-id='26760480' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='625' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='i2c_adapter_quirks' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='654' column='1' id='21fe2d6b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='655' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='max_num_msgs' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='656' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='max_write_len' type-id='1dc6a898' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='657' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='112'>
          <var-decl name='max_read_len' type-id='1dc6a898' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='658' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='max_comb_1st_msg_len' type-id='1dc6a898' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='659' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='max_comb_2nd_msg_len' type-id='1dc6a898' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='660' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='8f048e17' size-in-bits='64' id='474e5dcc'/>
      <qualified-type-def type-id='6739dd09' const='yes' id='bca91994'/>
      <pointer-type-def type-id='bca91994' size-in-bits='64' id='bc33861a'/>
      <qualified-type-def type-id='21fe2d6b' const='yes' id='d79644f2'/>
      <pointer-type-def type-id='d79644f2' size-in-bits='64' id='398e6008'/>
      <qualified-type-def type-id='547b1199' const='yes' id='9be24bae'/>
      <pointer-type-def type-id='9be24bae' size-in-bits='64' id='e93ce0cc'/>
      <qualified-type-def type-id='a9cdb48b' const='yes' id='220a92c2'/>
      <pointer-type-def type-id='220a92c2' size-in-bits='64' id='7ea54338'/>
      <qualified-type-def type-id='a94a041a' const='yes' id='00d2c7e1'/>
      <pointer-type-def type-id='00d2c7e1' size-in-bits='64' id='16d08491'/>
      <qualified-type-def type-id='0926e4bd' const='yes' id='a4974438'/>
      <pointer-type-def type-id='a4974438' size-in-bits='64' id='2c202856'/>
      <qualified-type-def type-id='19c2251e' const='yes' id='51bb592e'/>
      <pointer-type-def type-id='51bb592e' size-in-bits='64' id='aded214c'/>
      <pointer-type-def type-id='63b74212' size-in-bits='64' id='26760480'/>
      <pointer-type-def type-id='ec5384d3' size-in-bits='64' id='b9af02c3'/>
      <pointer-type-def type-id='d5526a99' size-in-bits='64' id='f1537b61'/>
      <pointer-type-def type-id='56ed3a25' size-in-bits='64' id='cd44bc95'/>
      <pointer-type-def type-id='1a96c066' size-in-bits='64' id='a556dccb'/>
      <pointer-type-def type-id='4033dd6b' size-in-bits='64' id='6ae2afd7'/>
      <pointer-type-def type-id='674bdea8' size-in-bits='64' id='4813c4da'/>
      <pointer-type-def type-id='86768fbb' size-in-bits='64' id='99dc8ee7'/>
      <pointer-type-def type-id='5d16c291' size-in-bits='64' id='3d5afe0d'/>
      <pointer-type-def type-id='8ab70c7a' size-in-bits='64' id='7881e15c'/>
      <pointer-type-def type-id='3de312fc' size-in-bits='64' id='f1c95c76'/>
      <pointer-type-def type-id='dea13b10' size-in-bits='64' id='7ad47ca2'/>
      <pointer-type-def type-id='a5eadeee' size-in-bits='64' id='e1759090'/>
      <pointer-type-def type-id='a2ef4917' size-in-bits='64' id='bbe45043'/>
      <pointer-type-def type-id='7e765fce' size-in-bits='64' id='8a2b0cc8'/>
      <pointer-type-def type-id='1d6846fa' size-in-bits='64' id='0871ecbc'/>
      <pointer-type-def type-id='064acd7a' size-in-bits='64' id='1c475548'/>
      <pointer-type-def type-id='f100815b' size-in-bits='64' id='8e62d7cb'/>
      <pointer-type-def type-id='a87c488a' size-in-bits='64' id='2869bb38'/>
      <pointer-type-def type-id='b82b9d3a' size-in-bits='64' id='dc5ce118'/>
      <pointer-type-def type-id='9a4619bf' size-in-bits='64' id='a91cd5f7'/>
      <pointer-type-def type-id='64f1e67b' size-in-bits='64' id='d0ff2b97'/>
      <pointer-type-def type-id='d385bfac' size-in-bits='64' id='8616a4a6'/>
      <pointer-type-def type-id='d6574e69' size-in-bits='64' id='8f19938d'/>
      <pointer-type-def type-id='9d4721a2' size-in-bits='64' id='6523d744'/>
      <pointer-type-def type-id='71099d68' size-in-bits='64' id='0b8fca52'/>
      <pointer-type-def type-id='eb940a3b' size-in-bits='64' id='8b74557f'/>
      <pointer-type-def type-id='267816c1' size-in-bits='64' id='644a4b55'/>
      <function-decl name='i2c_smbus_write_i2c_block_data' mangled-name='i2c_smbus_write_i2c_block_data' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='i2c_smbus_write_i2c_block_data'>
        <parameter type-id='7ea54338'/>
        <parameter type-id='002ac4a6'/>
        <parameter type-id='002ac4a6'/>
        <parameter type-id='354f7eb9'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='i2c_smbus_read_i2c_block_data' mangled-name='i2c_smbus_read_i2c_block_data' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='i2c_smbus_read_i2c_block_data'>
        <parameter type-id='7ea54338'/>
        <parameter type-id='002ac4a6'/>
        <parameter type-id='002ac4a6'/>
        <parameter type-id='cf536864'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='i2c_smbus_write_byte_data' mangled-name='i2c_smbus_write_byte_data' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='i2c_smbus_write_byte_data'>
        <parameter type-id='7ea54338'/>
        <parameter type-id='002ac4a6'/>
        <parameter type-id='002ac4a6'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='i2c_smbus_read_byte_data' mangled-name='i2c_smbus_read_byte_data' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/i2c.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='i2c_smbus_read_byte_data'>
        <parameter type-id='7ea54338'/>
        <parameter type-id='002ac4a6'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-type size-in-bits='64' id='4033dd6b'>
        <parameter type-id='b9af02c3'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='674bdea8'>
        <parameter type-id='b9af02c3'/>
        <parameter type-id='cd44bc95'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='86768fbb'>
        <parameter type-id='b9af02c3'/>
        <parameter type-id='1dc6a898'/>
        <parameter type-id='8efea9e5'/>
        <parameter type-id='a84c031d'/>
        <parameter type-id='f9b06939'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='a556dccb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='5d16c291'>
        <parameter type-id='b9af02c3'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='8ab70c7a'>
        <parameter type-id='7544e824'/>
        <parameter type-id='9a537bbe'/>
        <parameter type-id='aded214c'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='1d2c2b85'/>
        <parameter type-id='807869d3'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='3de312fc'>
        <parameter type-id='7544e824'/>
        <parameter type-id='9a537bbe'/>
        <parameter type-id='385b8018'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='dea13b10'>
        <parameter type-id='7544e824'/>
        <parameter type-id='1c475548'/>
        <parameter type-id='b50a4934'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='a5eadeee'>
        <parameter type-id='7544e824'/>
        <parameter type-id='2869bb38'/>
        <parameter type-id='385b8018'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='a2ef4917'>
        <parameter type-id='7544e824'/>
        <parameter type-id='2869bb38'/>
        <parameter type-id='1d2c2b85'/>
        <parameter type-id='807869d3'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='7e765fce'>
        <parameter type-id='7544e824'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='88370ce9'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='1d6846fa'>
        <parameter type-id='7544e824'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='64f1e67b'>
        <parameter type-id='b9af02c3'/>
        <return type-id='19c2251e'/>
      </function-type>
      <function-type size-in-bits='64' id='d385bfac'>
        <parameter type-id='b9af02c3'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='d6574e69'>
        <parameter type-id='b9af02c3'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='9d4721a2'>
        <parameter type-id='b9af02c3'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='71099d68'>
        <parameter type-id='7544e824'/>
        <parameter type-id='1c475548'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='eb940a3b'>
        <parameter type-id='7544e824'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='267816c1'>
        <parameter type-id='7544e824'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/gpu/drm/drm_sysfs.c' language='LANG_C89'>
      <class-decl name='class_attribute' size-in-bits='256' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='742' column='1' id='fc927268'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='attr' type-id='a6222917' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='743' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='show' type-id='c4c01ce7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='744' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='store' type-id='dfcac4bb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='746' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='fc927268' size-in-bits='64' id='9cc1ac3e'/>
      <qualified-type-def type-id='fc927268' const='yes' id='2bc6669b'/>
      <pointer-type-def type-id='2bc6669b' size-in-bits='64' id='9a53a8a3'/>
      <pointer-type-def type-id='32aa9d63' size-in-bits='64' id='c4c01ce7'/>
      <pointer-type-def type-id='5243924f' size-in-bits='64' id='dfcac4bb'/>
      <function-decl name='class_create_file_ns' mangled-name='class_create_file_ns' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='class_create_file_ns'>
        <parameter type-id='67aca04f'/>
        <parameter type-id='9a53a8a3'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='class_remove_file_ns' mangled-name='class_remove_file_ns' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='class_remove_file_ns'>
        <parameter type-id='67aca04f'/>
        <parameter type-id='9a53a8a3'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-type size-in-bits='64' id='32aa9d63'>
        <parameter type-id='67aca04f'/>
        <parameter type-id='9cc1ac3e'/>
        <parameter type-id='26a90f95'/>
        <return type-id='79a0948f'/>
      </function-type>
      <function-type size-in-bits='64' id='5243924f'>
        <parameter type-id='67aca04f'/>
        <parameter type-id='9cc1ac3e'/>
        <parameter type-id='80f4b756'/>
        <parameter type-id='b59d7dce'/>
        <return type-id='79a0948f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/hid/hid-steam.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='72' id='060772ed'>
        <subrange length='9' type-id='7ff19f0f' id='12e4273c'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1024' id='e3204322'>
        <subrange length='128' type-id='7ff19f0f' id='1eb1687a'/>
      </array-type-def>
      <class-decl name='thermal_cooling_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='3ae87f87'/>
      <class-decl name='thermal_zone_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='82084f52'/>
      <class-decl name='power_supply' size-in-bits='10176' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='307' column='1' id='98749268'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='desc' type-id='cb9cd99f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='308' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='supplied_to' type-id='9b23c9ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='310' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='num_supplicants' type-id='b59d7dce' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='311' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='supplied_from' type-id='9b23c9ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='313' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='num_supplies' type-id='b59d7dce' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='314' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='of_node' type-id='9a537bbf' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='315' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='drv_data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='318' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='321' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7808'>
          <var-decl name='changed_work' type-id='ef9025d0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='322' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8192'>
          <var-decl name='deferred_register_work' type-id='5ad6e0ef' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='323' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9280'>
          <var-decl name='changed_lock' type-id='fb4018a0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='324' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9312'>
          <var-decl name='changed' type-id='b50a4934' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='325' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9320'>
          <var-decl name='initialized' type-id='b50a4934' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='326' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9328'>
          <var-decl name='removing' type-id='b50a4934' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='327' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9344'>
          <var-decl name='use_cnt' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='328' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9408'>
          <var-decl name='tzd' type-id='404b1300' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='330' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9472'>
          <var-decl name='tcd' type-id='2feec21f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='331' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9536'>
          <var-decl name='charging_full_trig' type-id='db6d90a1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='335' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9600'>
          <var-decl name='charging_full_trig_name' type-id='26a90f95' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='336' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9664'>
          <var-decl name='charging_trig' type-id='db6d90a1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='337' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9728'>
          <var-decl name='charging_trig_name' type-id='26a90f95' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='338' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9792'>
          <var-decl name='full_trig' type-id='db6d90a1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='339' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9856'>
          <var-decl name='full_trig_name' type-id='26a90f95' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='340' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9920'>
          <var-decl name='online_trig' type-id='db6d90a1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='341' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9984'>
          <var-decl name='online_trig_name' type-id='26a90f95' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='342' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10048'>
          <var-decl name='charging_blink_full_solid_trig' type-id='db6d90a1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='343' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10112'>
          <var-decl name='charging_blink_full_solid_trig_name' type-id='26a90f95' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='344' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='power_supply_desc' size-in-bits='768' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='267' column='1' id='6d39b2d0'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='268' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='type' type-id='c61c3172' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='269' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='usb_types' type-id='f26ad218' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='270' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='num_usb_types' type-id='b59d7dce' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='271' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='properties' type-id='c0d0f1ae' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='272' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='num_properties' type-id='b59d7dce' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='273' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='get_property' type-id='c793cb80' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='set_property' type-id='7c0fed0f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='284' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='property_is_writeable' type-id='4079d8fe' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='292' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='external_power_changed' type-id='a89a6c47' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='294' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='set_charged' type-id='a89a6c47' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='295' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='no_thermal' type-id='b50a4934' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='302' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='use_for_apm' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='304' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='power_supply_type' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='179' column='1' id='c61c3172'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='POWER_SUPPLY_TYPE_UNKNOWN' value='0'/>
        <enumerator name='POWER_SUPPLY_TYPE_BATTERY' value='1'/>
        <enumerator name='POWER_SUPPLY_TYPE_UPS' value='2'/>
        <enumerator name='POWER_SUPPLY_TYPE_MAINS' value='3'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB' value='4'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_DCP' value='5'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_CDP' value='6'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_ACA' value='7'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_TYPE_C' value='8'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_PD' value='9'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_PD_DRP' value='10'/>
        <enumerator name='POWER_SUPPLY_TYPE_APPLE_BRICK_ID' value='11'/>
        <enumerator name='POWER_SUPPLY_TYPE_WIRELESS' value='12'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_HVDCP' value='13'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_HVDCP_3' value='14'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_HVDCP_3P5' value='15'/>
        <enumerator name='POWER_SUPPLY_TYPE_USB_FLOAT' value='16'/>
      </enum-decl>
      <enum-decl name='power_supply_usb_type' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='199' column='1' id='1f7f0095'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_UNKNOWN' value='0'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_SDP' value='1'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_DCP' value='2'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_CDP' value='3'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_ACA' value='4'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_C' value='5'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_PD' value='6'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_PD_DRP' value='7'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_PD_PPS' value='8'/>
        <enumerator name='POWER_SUPPLY_USB_TYPE_APPLE_BRICK_ID' value='9'/>
      </enum-decl>
      <enum-decl name='power_supply_property' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='95' column='1' id='5f78aa17'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='POWER_SUPPLY_PROP_STATUS' value='0'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_TYPE' value='1'/>
        <enumerator name='POWER_SUPPLY_PROP_HEALTH' value='2'/>
        <enumerator name='POWER_SUPPLY_PROP_PRESENT' value='3'/>
        <enumerator name='POWER_SUPPLY_PROP_ONLINE' value='4'/>
        <enumerator name='POWER_SUPPLY_PROP_AUTHENTIC' value='5'/>
        <enumerator name='POWER_SUPPLY_PROP_TECHNOLOGY' value='6'/>
        <enumerator name='POWER_SUPPLY_PROP_CYCLE_COUNT' value='7'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_MAX' value='8'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_MIN' value='9'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_MAX_DESIGN' value='10'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_MIN_DESIGN' value='11'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_NOW' value='12'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_AVG' value='13'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_OCV' value='14'/>
        <enumerator name='POWER_SUPPLY_PROP_VOLTAGE_BOOT' value='15'/>
        <enumerator name='POWER_SUPPLY_PROP_CURRENT_MAX' value='16'/>
        <enumerator name='POWER_SUPPLY_PROP_CURRENT_NOW' value='17'/>
        <enumerator name='POWER_SUPPLY_PROP_CURRENT_AVG' value='18'/>
        <enumerator name='POWER_SUPPLY_PROP_CURRENT_BOOT' value='19'/>
        <enumerator name='POWER_SUPPLY_PROP_POWER_NOW' value='20'/>
        <enumerator name='POWER_SUPPLY_PROP_POWER_AVG' value='21'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_FULL_DESIGN' value='22'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_EMPTY_DESIGN' value='23'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_FULL' value='24'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_EMPTY' value='25'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_NOW' value='26'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_AVG' value='27'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_COUNTER' value='28'/>
        <enumerator name='POWER_SUPPLY_PROP_CONSTANT_CHARGE_CURRENT' value='29'/>
        <enumerator name='POWER_SUPPLY_PROP_CONSTANT_CHARGE_CURRENT_MAX' value='30'/>
        <enumerator name='POWER_SUPPLY_PROP_CONSTANT_CHARGE_VOLTAGE' value='31'/>
        <enumerator name='POWER_SUPPLY_PROP_CONSTANT_CHARGE_VOLTAGE_MAX' value='32'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_CONTROL_LIMIT' value='33'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_CONTROL_LIMIT_MAX' value='34'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_CONTROL_START_THRESHOLD' value='35'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_CONTROL_END_THRESHOLD' value='36'/>
        <enumerator name='POWER_SUPPLY_PROP_INPUT_CURRENT_LIMIT' value='37'/>
        <enumerator name='POWER_SUPPLY_PROP_INPUT_VOLTAGE_LIMIT' value='38'/>
        <enumerator name='POWER_SUPPLY_PROP_INPUT_POWER_LIMIT' value='39'/>
        <enumerator name='POWER_SUPPLY_PROP_ENERGY_FULL_DESIGN' value='40'/>
        <enumerator name='POWER_SUPPLY_PROP_ENERGY_EMPTY_DESIGN' value='41'/>
        <enumerator name='POWER_SUPPLY_PROP_ENERGY_FULL' value='42'/>
        <enumerator name='POWER_SUPPLY_PROP_ENERGY_EMPTY' value='43'/>
        <enumerator name='POWER_SUPPLY_PROP_ENERGY_NOW' value='44'/>
        <enumerator name='POWER_SUPPLY_PROP_ENERGY_AVG' value='45'/>
        <enumerator name='POWER_SUPPLY_PROP_CAPACITY' value='46'/>
        <enumerator name='POWER_SUPPLY_PROP_CAPACITY_ALERT_MIN' value='47'/>
        <enumerator name='POWER_SUPPLY_PROP_CAPACITY_ALERT_MAX' value='48'/>
        <enumerator name='POWER_SUPPLY_PROP_CAPACITY_ERROR_MARGIN' value='49'/>
        <enumerator name='POWER_SUPPLY_PROP_CAPACITY_LEVEL' value='50'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP' value='51'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP_MAX' value='52'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP_MIN' value='53'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP_ALERT_MIN' value='54'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP_ALERT_MAX' value='55'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP_AMBIENT' value='56'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP_AMBIENT_ALERT_MIN' value='57'/>
        <enumerator name='POWER_SUPPLY_PROP_TEMP_AMBIENT_ALERT_MAX' value='58'/>
        <enumerator name='POWER_SUPPLY_PROP_TIME_TO_EMPTY_NOW' value='59'/>
        <enumerator name='POWER_SUPPLY_PROP_TIME_TO_EMPTY_AVG' value='60'/>
        <enumerator name='POWER_SUPPLY_PROP_TIME_TO_FULL_NOW' value='61'/>
        <enumerator name='POWER_SUPPLY_PROP_TIME_TO_FULL_AVG' value='62'/>
        <enumerator name='POWER_SUPPLY_PROP_TYPE' value='63'/>
        <enumerator name='POWER_SUPPLY_PROP_USB_TYPE' value='64'/>
        <enumerator name='POWER_SUPPLY_PROP_SCOPE' value='65'/>
        <enumerator name='POWER_SUPPLY_PROP_PRECHARGE_CURRENT' value='66'/>
        <enumerator name='POWER_SUPPLY_PROP_CHARGE_TERM_CURRENT' value='67'/>
        <enumerator name='POWER_SUPPLY_PROP_CALIBRATE' value='68'/>
        <enumerator name='POWER_SUPPLY_PROP_MANUFACTURE_YEAR' value='69'/>
        <enumerator name='POWER_SUPPLY_PROP_MANUFACTURE_MONTH' value='70'/>
        <enumerator name='POWER_SUPPLY_PROP_MANUFACTURE_DAY' value='71'/>
        <enumerator name='POWER_SUPPLY_PROP_MODEL_NAME' value='72'/>
        <enumerator name='POWER_SUPPLY_PROP_MANUFACTURER' value='73'/>
        <enumerator name='POWER_SUPPLY_PROP_SERIAL_NUMBER' value='74'/>
        <enumerator name='POWER_SUPPLY_PROP_QUICK_CHARGE_TYPE' value='75'/>
        <enumerator name='POWER_SUPPLY_PROP_TX_ADAPTER' value='76'/>
        <enumerator name='POWER_SUPPLY_PROP_SIGNAL_STRENGTH' value='77'/>
        <enumerator name='POWER_SUPPLY_PROP_REVERSE_CHG_MODE' value='78'/>
      </enum-decl>
      <union-decl name='power_supply_propval' size-in-bits='64' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='243' column='1' id='08942f16'>
        <data-member access='private'>
          <var-decl name='intval' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='244' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='strval' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='245' column='1'/>
        </data-member>
      </union-decl>
      <typedef-decl name='kernel_ulong_t' type-id='7359adad' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mod_devicetable.h' line='14' column='1' id='0791d6c8'/>
      <class-decl name='led_trigger' size-in-bits='576' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='338' column='1' id='7bcbad99'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='340' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='activate' type-id='0904d108' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='341' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='deactivate' type-id='749654e7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='342' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='leddev_list_lock' type-id='ac16795b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='345' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='led_cdevs' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='346' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='next_trig' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='349' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='groups' type-id='c97de1ac' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='351' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='led_classdev' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='58' column='1' id='6e0e17b0'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='59' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='brightness' type-id='fa598f35' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='max_brightness' type-id='fa598f35' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='flags' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='work_flags' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='brightness_set' type-id='971a91c1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='brightness_set_blocking' type-id='07e65680' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='brightness_get' type-id='a91f7d05' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='100' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='blink_set' type-id='adaf1c08' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='pattern_set' type-id='e9f2f0c0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='114' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='pattern_clear' type-id='0904d108' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='118' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='groups' type-id='c97de1ac' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='119' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='node' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='default_trigger' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='blink_delay_on' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='blink_delay_off' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='blink_timer' type-id='abe41e67' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='125' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='blink_brightness' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1568'>
          <var-decl name='new_blink_brightness' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='127' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='flash_resume' type-id='749654e7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='128' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='set_brightness_work' type-id='ef9025d0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='130' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='delayed_set_value' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='131' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='trigger_lock' type-id='f19fdb93' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='135' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='trigger' type-id='db6d90a1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='137' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='trig_list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='trigger_data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='139' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='activated' type-id='b50a4934' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='141' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='led_access' type-id='925167dc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='150' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='led_brightness' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='27' column='1' id='fa598f35'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='LED_OFF' value='0'/>
        <enumerator name='LED_ON' value='1'/>
        <enumerator name='LED_HALF' value='127'/>
        <enumerator name='LED_FULL' value='255'/>
      </enum-decl>
      <class-decl name='led_pattern' size-in-bits='64' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='574' column='1' id='de7f2597'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='delta_t' type-id='19c2251e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='575' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='brightness' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/leds.h' line='576' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='power_supply_config' size-in-bits='384' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='252' column='1' id='098cab97'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='of_node' type-id='9a537bbf' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='253' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='254' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='drv_data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='257' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='attr_grp' type-id='c97de1ac' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='260' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='supplied_to' type-id='9b23c9ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='262' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='num_supplicants' type-id='b59d7dce' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='263' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
      <qualified-type-def type-id='098cab97' const='yes' id='e45577b8'/>
      <pointer-type-def type-id='e45577b8' size-in-bits='64' id='048b3ad6'/>
      <qualified-type-def type-id='6d39b2d0' const='yes' id='79a9ff6f'/>
      <pointer-type-def type-id='79a9ff6f' size-in-bits='64' id='cb9cd99f'/>
      <qualified-type-def type-id='08942f16' const='yes' id='2cd7c576'/>
      <pointer-type-def type-id='2cd7c576' size-in-bits='64' id='f3abafd4'/>
      <pointer-type-def type-id='f7c7c7f9' size-in-bits='64' id='a91f7d05'/>
      <pointer-type-def type-id='821e33ee' size-in-bits='64' id='0904d108'/>
      <pointer-type-def type-id='6a0fd5a6' size-in-bits='64' id='07e65680'/>
      <pointer-type-def type-id='fcd4ba8e' size-in-bits='64' id='e9f2f0c0'/>
      <pointer-type-def type-id='4b04075e' size-in-bits='64' id='adaf1c08'/>
      <pointer-type-def type-id='50e956a4' size-in-bits='64' id='4079d8fe'/>
      <pointer-type-def type-id='6daa74bb' size-in-bits='64' id='7c0fed0f'/>
      <pointer-type-def type-id='40d98f1e' size-in-bits='64' id='c793cb80'/>
      <pointer-type-def type-id='6e0e17b0' size-in-bits='64' id='bd1c8eb6'/>
      <pointer-type-def type-id='de7f2597' size-in-bits='64' id='e98ceb7f'/>
      <pointer-type-def type-id='7bcbad99' size-in-bits='64' id='db6d90a1'/>
      <pointer-type-def type-id='98749268' size-in-bits='64' id='c0c93c9e'/>
      <pointer-type-def type-id='5f78aa17' size-in-bits='64' id='c0d0f1ae'/>
      <pointer-type-def type-id='08942f16' size-in-bits='64' id='2e53d20f'/>
      <pointer-type-def type-id='1f7f0095' size-in-bits='64' id='f26ad218'/>
      <pointer-type-def type-id='3ae87f87' size-in-bits='64' id='2feec21f'/>
      <pointer-type-def type-id='82084f52' size-in-bits='64' id='404b1300'/>
      <pointer-type-def type-id='7359adad' size-in-bits='64' id='1d2c2b85'/>
      <pointer-type-def type-id='6dea5f13' size-in-bits='64' id='749654e7'/>
      <pointer-type-def type-id='a373c61d' size-in-bits='64' id='971a91c1'/>
      <pointer-type-def type-id='ffbf2003' size-in-bits='64' id='a89a6c47'/>
      <function-decl name='power_supply_unregister' mangled-name='power_supply_unregister' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='power_supply_unregister'>
        <parameter type-id='c0c93c9e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='power_supply_register' mangled-name='power_supply_register' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/power_supply.h' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='power_supply_register'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='cb9cd99f'/>
        <parameter type-id='048b3ad6'/>
        <return type-id='c0c93c9e'/>
      </function-decl>
      <function-type size-in-bits='64' id='f7c7c7f9'>
        <parameter type-id='bd1c8eb6'/>
        <return type-id='fa598f35'/>
      </function-type>
      <function-type size-in-bits='64' id='821e33ee'>
        <parameter type-id='bd1c8eb6'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='6a0fd5a6'>
        <parameter type-id='bd1c8eb6'/>
        <parameter type-id='fa598f35'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='fcd4ba8e'>
        <parameter type-id='bd1c8eb6'/>
        <parameter type-id='e98ceb7f'/>
        <parameter type-id='19c2251e'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='4b04075e'>
        <parameter type-id='bd1c8eb6'/>
        <parameter type-id='1d2c2b85'/>
        <parameter type-id='1d2c2b85'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='50e956a4'>
        <parameter type-id='c0c93c9e'/>
        <parameter type-id='5f78aa17'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='6daa74bb'>
        <parameter type-id='c0c93c9e'/>
        <parameter type-id='5f78aa17'/>
        <parameter type-id='f3abafd4'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='40d98f1e'>
        <parameter type-id='c0c93c9e'/>
        <parameter type-id='5f78aa17'/>
        <parameter type-id='2e53d20f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='6dea5f13'>
        <parameter type-id='bd1c8eb6'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='a373c61d'>
        <parameter type-id='bd1c8eb6'/>
        <parameter type-id='fa598f35'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='ffbf2003'>
        <parameter type-id='c0c93c9e'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/pinctrl/devicetree.c' language='LANG_C89'>
      <function-decl name='of_get_next_parent' mangled-name='of_get_next_parent' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/of.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='of_get_next_parent'>
        <parameter type-id='9a537bbe'/>
        <return type-id='9a537bbe'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/power/supply/power_supply_core.c' language='LANG_C89'>
      <function-decl name='power_supply_is_system_supplied' mangled-name='power_supply_is_system_supplied' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/power/supply/power_supply_core.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='power_supply_is_system_supplied'>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/scsi/scsi.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='32406f0a' size-in-bits='384' id='ffbe012f'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <class-decl name='blk_mq_tags' is-struct='yes' visibility='default' is-declaration-only='yes' id='8efd3865'/>
      <class-decl name='scsi_device_handler' is-struct='yes' visibility='default' is-declaration-only='yes' id='4e8a6f85'/>
      <class-decl name='scsi_host_cmd_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='94982f58'/>
      <class-decl name='scsi_transport_template' is-struct='yes' visibility='default' is-declaration-only='yes' id='0e15337c'/>
      <array-type-def dimensions='1' type-id='e4a7867c' size-in-bits='infinite' id='6abca080'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='128' id='92a46553'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='infinite' id='5e6516ee'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='448' id='346bc576'>
        <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
      </array-type-def>
      <class-decl name='scsi_device' size-in-bits='19456' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='102' column='1' id='e07b5dbe'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='host' type-id='a970a64c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='request_queue' type-id='e7d2a5fc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='siblings' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='same_target_siblings' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='device_busy' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='device_blocked' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='111' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='list_lock' type-id='fb4018a0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='cmd_list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='114' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='starved_entry' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='115' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='queue_depth' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='784'>
          <var-decl name='max_queue_depth' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='117' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='800'>
          <var-decl name='last_queue_full_depth' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='118' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='816'>
          <var-decl name='last_queue_full_count' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='119' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='last_queue_full_time' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='queue_ramp_up_period' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='last_queue_ramp_up' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='id' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1056'>
          <var-decl name='channel' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='lun' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='127' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='manufacturer' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='128' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1184'>
          <var-decl name='sector_size' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='130' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='hostdata' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='132' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='type' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1288'>
          <var-decl name='scsi_level' type-id='a84c031d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='134' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1296'>
          <var-decl name='inq_periph_qual' type-id='a84c031d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='135' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='inquiry_mutex' type-id='925167dc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='136' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='inquiry_len' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='137' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='inquiry' type-id='cf536864' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='vendor' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='139' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='model' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='140' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='rev' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='141' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='vpd_pg83' type-id='2b88fa00' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='144' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='vpd_pg80' type-id='2b88fa00' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='145' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='current_tag' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='146' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='sdev_target' type-id='4cb5819d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='147' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='sdev_bflags' type-id='ec838379' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='149' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='eh_timeout' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='removable' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='154' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30'>
          <var-decl name='changed' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='155' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='29'>
          <var-decl name='busy' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='156' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='28'>
          <var-decl name='lockable' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='157' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27'>
          <var-decl name='locked' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='158' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26'>
          <var-decl name='borken' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='159' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25'>
          <var-decl name='disconnect' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='161' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='soft_reset' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='162' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23'>
          <var-decl name='sdtr' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='163' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='22'>
          <var-decl name='wdtr' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='164' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='21'>
          <var-decl name='ppr' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='165' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20'>
          <var-decl name='tagged_supported' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='166' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19'>
          <var-decl name='simple_tags' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='167' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18'>
          <var-decl name='was_reset' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='168' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17'>
          <var-decl name='expecting_cc_ua' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='170' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='use_10_for_rw' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='172' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15'>
          <var-decl name='use_10_for_ms' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='173' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14'>
          <var-decl name='set_dbd_for_ms' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='174' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13'>
          <var-decl name='no_report_opcodes' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='175' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12'>
          <var-decl name='no_write_same' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='176' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11'>
          <var-decl name='use_16_for_rw' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='177' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10'>
          <var-decl name='skip_ms_page_8' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='178' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9'>
          <var-decl name='skip_ms_page_3f' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='179' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='skip_vpd_pages' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='180' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7'>
          <var-decl name='try_vpd_pages' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='181' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6'>
          <var-decl name='use_192_bytes_for_3f' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='182' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5'>
          <var-decl name='no_start_on_add' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='183' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4'>
          <var-decl name='allow_restart' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='184' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3'>
          <var-decl name='manage_start_stop' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='185' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='start_stop_pwr_cond' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='186' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1'>
          <var-decl name='no_uld_attach' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='187' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2272'>
          <var-decl name='select_no_atn' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='188' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='fix_capacity' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='189' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30'>
          <var-decl name='guess_capacity' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='190' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='29'>
          <var-decl name='retry_hwerror' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='191' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='28'>
          <var-decl name='last_sector_bug' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='192' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27'>
          <var-decl name='no_read_disc_info' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='194' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26'>
          <var-decl name='no_read_capacity_16' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='195' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25'>
          <var-decl name='try_rc_10_first' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='196' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='security_supported' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='197' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23'>
          <var-decl name='is_visible' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='198' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='22'>
          <var-decl name='wce_default_on' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='199' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='21'>
          <var-decl name='no_dif' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='200' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20'>
          <var-decl name='broken_fua' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='201' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19'>
          <var-decl name='lun_in_cdb' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='202' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18'>
          <var-decl name='unmap_limit_for_ws' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='203' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17'>
          <var-decl name='rpm_autosuspend' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='204' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2336'>
          <var-decl name='disk_events_disable_depth' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='206' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='supported_events' type-id='f066dd3c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='208' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='pending_events' type-id='f066dd3c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='209' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='event_list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='210' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='event_work' type-id='ef9025d0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='211' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='max_device_blocked' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='213' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3040'>
          <var-decl name='iorequest_cnt' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='216' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='iodone_cnt' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='217' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3104'>
          <var-decl name='ioerr_cnt' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='218' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='sdev_gendev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='220' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='10496'>
          <var-decl name='sdev_dev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='221' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17856'>
          <var-decl name='ew' type-id='53f7ea88' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='223' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18240'>
          <var-decl name='requeue_work' type-id='ef9025d0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='224' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18624'>
          <var-decl name='handler' type-id='0a0775b5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='226' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18688'>
          <var-decl name='handler_data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='227' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18752'>
          <var-decl name='access_state' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='229' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18816'>
          <var-decl name='state_mutex' type-id='925167dc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='230' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19072'>
          <var-decl name='sdev_state' type-id='7e4b2e83' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='231' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19136'>
          <var-decl name='quiesced_by' type-id='f23e2572' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='232' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19200'>
          <var-decl name='sdev_data' type-id='c99b5ecd' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='233' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19200'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='235' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19264'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='236' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19328'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='237' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19392'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='238' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='Scsi_Host' size-in-bits='19008' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='533' column='1' id='83cec606'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='__devices' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='542' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='__targets' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='543' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='starved_list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='545' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='default_lock' type-id='fb4018a0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='547' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='host_lock' type-id='cff2d845' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='548' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='scan_mutex' type-id='925167dc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='550' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='eh_cmd_q' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='552' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='ehandler' type-id='f23e2572' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='553' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='eh_action' type-id='389faaf7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='554' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='host_wait' type-id='b5ab048f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='556' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='hostt' type-id='36265581' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='557' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='transportt' type-id='498f47da' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='558' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='tag_set' type-id='651086d7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='561' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='host_busy' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='563' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2656'>
          <var-decl name='host_blocked' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='564' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='host_failed' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2720'>
          <var-decl name='host_eh_scheduled' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='568' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='host_no' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='570' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2784'>
          <var-decl name='eh_deadline' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='573' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='last_reset' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='574' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='max_channel' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='583' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2912'>
          <var-decl name='max_id' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='584' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='max_lun' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='585' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='unique_id' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='594' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3040'>
          <var-decl name='max_cmd_len' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='603' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='this_id' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='605' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3104'>
          <var-decl name='can_queue' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='606' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='cmd_per_lun' type-id='a2185560' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='607' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3152'>
          <var-decl name='sg_tablesize' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='608' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3168'>
          <var-decl name='sg_prot_tablesize' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='609' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='max_sectors' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='610' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3232'>
          <var-decl name='max_segment_size' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='611' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3264'>
          <var-decl name='dma_boundary' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='612' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='virt_boundary_mask' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='613' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='nr_hw_queues' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='621' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30'>
          <var-decl name='active_mode' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='622' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='29'>
          <var-decl name='unchecked_isa_dma' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='623' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='28'>
          <var-decl name='host_self_blocked' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='629' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27'>
          <var-decl name='reverse_ordering' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='636' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26'>
          <var-decl name='tmf_in_progress' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='639' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25'>
          <var-decl name='async_scan' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='642' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='eh_noresume' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='645' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23'>
          <var-decl name='no_write_same' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='648' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='22'>
          <var-decl name='use_cmd_list' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='650' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='21'>
          <var-decl name='short_inquiry' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='653' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20'>
          <var-decl name='no_scsi2_lun_in_cdb' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='656' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3440'>
          <var-decl name='work_q_name' type-id='664ac0b7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='661' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3648'>
          <var-decl name='work_q' type-id='242e3d19' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='662' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3712'>
          <var-decl name='tmf_work_q' type-id='242e3d19' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='667' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3776'>
          <var-decl name='max_host_blocked' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='672' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3808'>
          <var-decl name='prot_capabilities' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='675' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3840'>
          <var-decl name='prot_guard_type' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='676' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3904'>
          <var-decl name='base' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='679' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3968'>
          <var-decl name='io_port' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='680' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4032'>
          <var-decl name='n_io_port' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='681' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4040'>
          <var-decl name='dma_channel' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='682' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4064'>
          <var-decl name='irq' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='683' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4096'>
          <var-decl name='shost_state' type-id='e41e14c7' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='686' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4160'>
          <var-decl name='shost_gendev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='689' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11520'>
          <var-decl name='shost_dev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='689' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18880'>
          <var-decl name='shost_data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='695' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18944'>
          <var-decl name='dma_dev' type-id='fa0b179b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='701' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='19008'>
          <var-decl name='hostdata' type-id='c99b5ecd' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='708' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='queue_rq_fn' type-id='32672900' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='123' column='1' id='aa8737f6'/>
      <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='16' column='1' id='e7f43f72'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='17' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='dispatch' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='18' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='state' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='19' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sbitmap' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='48' column='1' id='6e051ed1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='depth' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='shift' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='map_nr' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='map' type-id='278a4544' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='67' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sbitmap_word' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='20' column='1' id='28e1d9ae'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='depth' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='24' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='word' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='cleared' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='swap_lock' type-id='fb4018a0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sbitmap.h' line='39' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='wait_queue_entry_t' type-id='504855b3' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/wait.h' line='14' column='1' id='fe794aa9'/>
      <class-decl name='wait_queue_entry' size-in-bits='320' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/wait.h' line='27' column='1' id='504855b3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/wait.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='private' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/wait.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='func' type-id='67119c17' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/wait.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='entry' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/wait.h' line='31' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='wait_queue_func_t' type-id='3e643710' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/wait.h' line='16' column='1' id='67119c17'/>
      <class-decl name='blk_mq_queue_data' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='118' column='1' id='03a1b8ac'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rq' type-id='3dad1a48' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='119' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='last' type-id='b50a4934' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='120' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='commit_rqs_fn' type-id='4e7ef9a4' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='125' column='1' id='ac1c385d'/>
      <typedef-decl name='get_budget_fn' type-id='c2be64d1' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='126' column='1' id='f47b0345'/>
      <typedef-decl name='put_budget_fn' type-id='4e7ef9a4' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='127' column='1' id='695ed59c'/>
      <typedef-decl name='timeout_fn' type-id='9b58f3d9' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='128' column='1' id='9509b3ac'/>
      <enum-decl name='blk_eh_timer_return' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blkdev.h' line='296' column='1' id='0f4f6276'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='BLK_EH_DONE' value='0'/>
        <enumerator name='BLK_EH_RESET_TIMER' value='1'/>
      </enum-decl>
      <typedef-decl name='poll_fn' type-id='8ce1651f' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='139' column='1' id='9a083a6e'/>
      <typedef-decl name='complete_fn' type-id='45e743e9' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='142' column='1' id='f7915bc8'/>
      <typedef-decl name='init_hctx_fn' type-id='02e8b0a1' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='129' column='1' id='76c7c9df'/>
      <typedef-decl name='exit_hctx_fn' type-id='4f1e6b9a' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='130' column='1' id='e6f81ea9'/>
      <typedef-decl name='init_request_fn' type-id='722249f6' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='131' column='1' id='4e958389'/>
      <class-decl name='blk_mq_queue_map' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='79' column='1' id='32406f0a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mq_map' type-id='807869d3' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='80' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='nr_queues' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='81' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='queue_offset' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='82' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='exit_request_fn' type-id='9d05a3e9' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='133' column='1' id='d63f4ff3'/>
      <typedef-decl name='cleanup_rq_fn' type-id='45e743e9' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='143' column='1' id='3577ed21'/>
      <typedef-decl name='busy_fn' type-id='06c81b64' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='141' column='1' id='53cc9bd6'/>
      <typedef-decl name='map_queues_fn' type-id='640838f9' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/blk-mq.h' line='140' column='1' id='6e9b911c'/>
      <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/iocontext.h' line='83' column='1' id='ac5ab595'>
        <data-member access='private'>
          <var-decl name='q_node' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/iocontext.h' line='84' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='__rcu_icq_cache' type-id='f3b4aca8' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/iocontext.h' line='85' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/iocontext.h' line='87' column='1' id='f6cbf12c'>
        <data-member access='private'>
          <var-decl name='ioc_node' type-id='03a4a074' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/iocontext.h' line='88' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='__rcu_head' type-id='e3d8ce29' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/iocontext.h' line='89' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sched.h' line='1321' column='1' id='f9cbf5e5'>
        <data-member access='private'>
          <var-decl name='rcu_users' type-id='64615833' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sched.h' line='1322' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sched.h' line='1323' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='scsi_host_template' size-in-bits='3008' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='46' column='1' id='1a0d5389'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='module' type-id='2730d016' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='info' type-id='91464e34' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='ioctl' type-id='73550cb4' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='64' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='compat_ioctl' type-id='73550cb4' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='queuecommand' type-id='5e9804d5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='commit_rqs' type-id='fddad99e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='eh_abort_handler' type-id='0786894c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='143' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='eh_device_reset_handler' type-id='0786894c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='144' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='eh_target_reset_handler' type-id='0786894c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='145' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='eh_bus_reset_handler' type-id='0786894c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='146' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='eh_host_reset_handler' type-id='0786894c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='147' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='slave_alloc' type-id='4fae2c98' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='175' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='slave_configure' type-id='4fae2c98' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='206' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='slave_destroy' type-id='38c41fe1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='217' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='target_alloc' type-id='55bb6559' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='231' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='target_destroy' type-id='36e7f8ac' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='241' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='scan_finished' type-id='07445d6c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='252' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='scan_start' type-id='7fc5dc19' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='261' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='change_queue_depth' type-id='38313007' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='274' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='map_queues' type-id='1a9d259c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='bios_param' type-id='4c72f20d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='292' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='unlock_native_capacity' type-id='38c41fe1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='301' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='show_info' type-id='b9e33ab0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='310' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='write_info' type-id='ff0f7577' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='311' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='eh_timed_out' type-id='7114e104' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='320' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='host_reset' type-id='203d9a9b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='330' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='proc_name' type-id='80f4b756' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='338' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='proc_dir' type-id='d077e928' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='344' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='can_queue' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='351' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1888'>
          <var-decl name='this_id' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='360' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='sg_tablesize' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='366' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1936'>
          <var-decl name='sg_prot_tablesize' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='367' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1952'>
          <var-decl name='max_sectors' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='372' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='max_segment_size' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='377' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='dma_boundary' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='383' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='virt_boundary_mask' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='385' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='cmd_per_lun' type-id='a2185560' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='404' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2192'>
          <var-decl name='present' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='410' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2208'>
          <var-decl name='tag_alloc_policy' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='413' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='track_queue_depth' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='418' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='29'>
          <var-decl name='supported_mode' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='423' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='28'>
          <var-decl name='unchecked_isa_dma' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27'>
          <var-decl name='emulated' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='433' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26'>
          <var-decl name='skip_settle_delay' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='438' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25'>
          <var-decl name='no_write_same' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='441' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='force_blk_mq' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='444' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2272'>
          <var-decl name='max_host_blocked' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='449' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='shost_attrs' type-id='aa9eb300' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='463' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='sdev_attrs' type-id='aa9eb300' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='468' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='sdev_groups' type-id='c97de1ac' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='474' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='vendor_id' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='cmd_size' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='488' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='cmd_pool' type-id='4783492e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='489' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='rpm_autosuspend_delay' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='492' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='494' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='495' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='496' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='497' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='scsi_cmnd' size-in-bits='3904' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='68' column='1' id='fe7ab802'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='req' type-id='dec7ed8d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='69' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='device' type-id='eb572b74' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='eh_entry' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='abort_work' type-id='5ad6e0ef' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='eh_eflags' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='jiffies_at_alloc' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='84' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='retries' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='86' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2144'>
          <var-decl name='allowed' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='87' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='prot_op' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='89' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2184'>
          <var-decl name='prot_type' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='90' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2192'>
          <var-decl name='prot_flags' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='91' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2208'>
          <var-decl name='cmd_len' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='sc_data_direction' type-id='eea6b025' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='cmnd' type-id='cf536864' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='sdb' type-id='9f8b0d0f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='101' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='prot_sdb' type-id='8502fa27' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='underflow' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2656'>
          <var-decl name='transfersize' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='107' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='request' type-id='3dad1a48' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='sense_buffer' type-id='cf536864' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='scsi_done' type-id='466c873d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='SCp' type-id='fd44f8bd' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='130' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='host_scribble' type-id='cf536864' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='132' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='result' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='140' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3488'>
          <var-decl name='flags' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='141' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3520'>
          <var-decl name='state' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='142' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3584'>
          <var-decl name='tag' type-id='002ac4a6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='144' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3648'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='146' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3712'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='147' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3776'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='148' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3840'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='149' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='scsi_request' size-in-bits='448' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='9' column='1' id='dec7ed8d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='__cmd' type-id='92a46553' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='10' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='cmd' type-id='cf536864' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='11' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='cmd_len' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='12' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='result' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='13' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='sense_len' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='14' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='resid_len' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='15' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='retries' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='16' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='sense' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_request.h' line='17' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='scsi_data_buffer' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='36' column='1' id='9f8b0d0f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='table' type-id='c59e4f4c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='length' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='38' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='scsi_pointer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='42' column='1' id='fd44f8bd'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='ptr' type-id='26a90f95' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='this_residual' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='buffer' type-id='bf3ef905' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='buffers_residual' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='dma_handle' type-id='cf29c9b3' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='Status' type-id='e024ff18' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='352'>
          <var-decl name='Message' type-id='e024ff18' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='have_data_in' type-id='e024ff18' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='sent_command' type-id='e024ff18' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='phase' type-id='e024ff18' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_cmnd.h' line='54' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='scsi_target' size-in-bits='8064' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='287' column='1' id='148c2b1d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='starget_sdev_user' type-id='eb572b74' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='288' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='siblings' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='289' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='devices' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='290' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='291' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7680'>
          <var-decl name='reap_ref' type-id='400fb07b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='292' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7712'>
          <var-decl name='channel' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='293' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7744'>
          <var-decl name='id' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='294' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31'>
          <var-decl name='create' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='296' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30'>
          <var-decl name='single_lun' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='297' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='29'>
          <var-decl name='pdt_1f_for_no_lun' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='300' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='28'>
          <var-decl name='no_report_luns' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='302' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27'>
          <var-decl name='expecting_lun_change' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='304' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7808'>
          <var-decl name='target_busy' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='308' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7840'>
          <var-decl name='target_blocked' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='309' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7872'>
          <var-decl name='can_queue' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='315' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7904'>
          <var-decl name='max_target_blocked' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='316' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7936'>
          <var-decl name='scsi_level' type-id='a84c031d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='319' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7968'>
          <var-decl name='state' type-id='0e1b99c8' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='320' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8000'>
          <var-decl name='hostdata' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='321' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='starget_data' type-id='c99b5ecd' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='322' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='scsi_target_state' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='274' column='1' id='0e1b99c8'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='STARGET_CREATED' value='1'/>
        <enumerator name='STARGET_RUNNING' value='2'/>
        <enumerator name='STARGET_REMOVE' value='3'/>
        <enumerator name='STARGET_CREATED_REMOVE' value='4'/>
        <enumerator name='STARGET_DEL' value='5'/>
      </enum-decl>
      <class-decl name='device_attribute' size-in-bits='256' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='837' column='1' id='dbf3947c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='attr' type-id='a6222917' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='838' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='show' type-id='3dcc4acf' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='839' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='store' type-id='839105d3' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/device.h' line='841' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='scsi_host_state' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_host.h' line='523' column='1' id='e41e14c7'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='SHOST_CREATED' value='1'/>
        <enumerator name='SHOST_RUNNING' value='2'/>
        <enumerator name='SHOST_CANCEL' value='3'/>
        <enumerator name='SHOST_DEL' value='4'/>
        <enumerator name='SHOST_RECOVERY' value='5'/>
        <enumerator name='SHOST_CANCEL_RECOVERY' value='6'/>
        <enumerator name='SHOST_DEL_RECOVERY' value='7'/>
      </enum-decl>
      <class-decl name='scsi_vpd' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='96' column='1' id='4399e1b2'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='98' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='data' type-id='5e6516ee' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='99' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='blist_flags_t' type-id='d3130597' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='19' column='1' id='ec838379'/>
      <class-decl name='execute_work' size-in-bits='384' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/workqueue.h' line='174' column='1' id='53f7ea88'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='work' type-id='ef9025d0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/workqueue.h' line='175' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='scsi_device_state' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/scsi/scsi_device.h' line='37' column='1' id='7e4b2e83'>
        <underlying-type type-id='6406df84'/>
        <enumerator name='SDEV_CREATED' value='1'/>
        <enumerator name='SDEV_RUNNING' value='2'/>
        <enumerator name='SDEV_CANCEL' value='3'/>
        <enumerator name='SDEV_DEL' value='4'/>
        <enumerator name='SDEV_QUIESCE' value='5'/>
        <enumerator name='SDEV_OFFLINE' value='6'/>
        <enumerator name='SDEV_TRANSPORT_OFFLINE' value='7'/>
        <enumerator name='SDEV_BLOCK' value='8'/>
        <enumerator name='SDEV_CREATED_BLOCK' value='9'/>
      </enum-decl>
      <pointer-type-def type-id='83cec606' size-in-bits='64' id='a970a64c'/>
      <pointer-type-def type-id='9a335021' size-in-bits='64' id='c9c70151'/>
      <pointer-type-def type-id='8efd3865' size-in-bits='64' id='0461ecf5'/>
      <pointer-type-def type-id='0461ecf5' size-in-bits='64' id='c527e30d'/>
      <pointer-type-def type-id='53cc9bd6' size-in-bits='64' id='65c718a5'/>
      <pointer-type-def type-id='3577ed21' size-in-bits='64' id='ac8cd584'/>
      <pointer-type-def type-id='ac1c385d' size-in-bits='64' id='10b13b44'/>
      <pointer-type-def type-id='f7915bc8' size-in-bits='64' id='681aaa17'/>
      <qualified-type-def type-id='03a1b8ac' const='yes' id='a2b0f227'/>
      <pointer-type-def type-id='a2b0f227' size-in-bits='64' id='298d0a77'/>
      <pointer-type-def type-id='369a41ea' size-in-bits='64' id='91464e34'/>
      <pointer-type-def type-id='dbf3947c' size-in-bits='64' id='89a2612a'/>
      <pointer-type-def type-id='89a2612a' size-in-bits='64' id='aa9eb300'/>
      <pointer-type-def type-id='291d9c02' size-in-bits='64' id='7114e104'/>
      <pointer-type-def type-id='e6f81ea9' size-in-bits='64' id='1fb247c2'/>
      <pointer-type-def type-id='d63f4ff3' size-in-bits='64' id='9a2e43a6'/>
      <pointer-type-def type-id='f47b0345' size-in-bits='64' id='9712eb54'/>
      <pointer-type-def type-id='76c7c9df' size-in-bits='64' id='e1f2504c'/>
      <pointer-type-def type-id='4e958389' size-in-bits='64' id='57e65d80'/>
      <pointer-type-def type-id='fb9c833a' size-in-bits='64' id='1a9d259c'/>
      <pointer-type-def type-id='20affdf3' size-in-bits='64' id='ff0f7577'/>
      <pointer-type-def type-id='d2f6c36f' size-in-bits='64' id='203d9a9b'/>
      <pointer-type-def type-id='d15eda11' size-in-bits='64' id='5e9804d5'/>
      <pointer-type-def type-id='9423c42a' size-in-bits='64' id='07445d6c'/>
      <pointer-type-def type-id='97ca9b12' size-in-bits='64' id='0786894c'/>
      <pointer-type-def type-id='53efb49e' size-in-bits='64' id='4fae2c98'/>
      <pointer-type-def type-id='8ff31849' size-in-bits='64' id='4c72f20d'/>
      <pointer-type-def type-id='686e5e33' size-in-bits='64' id='38313007'/>
      <pointer-type-def type-id='ec8e7b62' size-in-bits='64' id='73550cb4'/>
      <pointer-type-def type-id='af8a50f5' size-in-bits='64' id='55bb6559'/>
      <pointer-type-def type-id='f680e13e' size-in-bits='64' id='b9e33ab0'/>
      <pointer-type-def type-id='3cab519e' size-in-bits='64' id='3e643710'/>
      <pointer-type-def type-id='6e9b911c' size-in-bits='64' id='06a241cf'/>
      <pointer-type-def type-id='9a083a6e' size-in-bits='64' id='969a6bcd'/>
      <pointer-type-def type-id='695ed59c' size-in-bits='64' id='247cb56b'/>
      <pointer-type-def type-id='aa8737f6' size-in-bits='64' id='cf544519'/>
      <pointer-type-def type-id='28e1d9ae' size-in-bits='64' id='278a4544'/>
      <pointer-type-def type-id='fe7ab802' size-in-bits='64' id='0b8718c0'/>
      <pointer-type-def type-id='9f8b0d0f' size-in-bits='64' id='8502fa27'/>
      <pointer-type-def type-id='e07b5dbe' size-in-bits='64' id='eb572b74'/>
      <pointer-type-def type-id='4e8a6f85' size-in-bits='64' id='0a0775b5'/>
      <pointer-type-def type-id='94982f58' size-in-bits='64' id='4783492e'/>
      <pointer-type-def type-id='1a0d5389' size-in-bits='64' id='36265581'/>
      <pointer-type-def type-id='148c2b1d' size-in-bits='64' id='4cb5819d'/>
      <pointer-type-def type-id='0e15337c' size-in-bits='64' id='498f47da'/>
      <pointer-type-def type-id='4399e1b2' size-in-bits='64' id='2b88fa00'/>
      <pointer-type-def type-id='9509b3ac' size-in-bits='64' id='23816d7d'/>
      <pointer-type-def type-id='4bbe36cb' size-in-bits='64' id='3dcc4acf'/>
      <pointer-type-def type-id='50bd3cc7' size-in-bits='64' id='839105d3'/>
      <pointer-type-def type-id='d7413fe5' size-in-bits='64' id='7fc5dc19'/>
      <pointer-type-def type-id='0457ac44' size-in-bits='64' id='fddad99e'/>
      <pointer-type-def type-id='57109d59' size-in-bits='64' id='466c873d'/>
      <pointer-type-def type-id='9102a0ad' size-in-bits='64' id='38c41fe1'/>
      <pointer-type-def type-id='ed6fc6ea' size-in-bits='64' id='36e7f8ac'/>
      <qualified-type-def type-id='95e97e5e' volatile='yes' id='e024ff18'/>
      <pointer-type-def type-id='504855b3' size-in-bits='64' id='db9d03e3'/>
      <function-decl name='__scsi_iterate_devices' mangled-name='__scsi_iterate_devices' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/scsi/scsi.c' line='564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__scsi_iterate_devices'>
        <parameter type-id='a970a64c' name='shost' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/scsi/scsi.c' line='564' column='1'/>
        <parameter type-id='eb572b74' name='prev' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/drivers/scsi/scsi.c' line='565' column='1'/>
        <return type-id='eb572b74'/>
      </function-decl>
      <function-type size-in-bits='64' id='369a41ea'>
        <parameter type-id='a970a64c'/>
        <return type-id='80f4b756'/>
      </function-type>
      <function-type size-in-bits='64' id='9b58f3d9'>
        <parameter type-id='3dad1a48'/>
        <parameter type-id='b50a4934'/>
        <return type-id='0f4f6276'/>
      </function-type>
      <function-type size-in-bits='64' id='291d9c02'>
        <parameter type-id='0b8718c0'/>
        <return type-id='0f4f6276'/>
      </function-type>
      <function-type size-in-bits='64' id='fb9c833a'>
        <parameter type-id='a970a64c'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='20affdf3'>
        <parameter type-id='a970a64c'/>
        <parameter type-id='26a90f95'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='d2f6c36f'>
        <parameter type-id='a970a64c'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='d15eda11'>
        <parameter type-id='a970a64c'/>
        <parameter type-id='0b8718c0'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='9423c42a'>
        <parameter type-id='a970a64c'/>
        <parameter type-id='7359adad'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='8ce1651f'>
        <parameter type-id='a47d3467'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='02e8b0a1'>
        <parameter type-id='a47d3467'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='640838f9'>
        <parameter type-id='cc26d15f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='722249f6'>
        <parameter type-id='cc26d15f'/>
        <parameter type-id='3dad1a48'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='97ca9b12'>
        <parameter type-id='0b8718c0'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='53efb49e'>
        <parameter type-id='eb572b74'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='8ff31849'>
        <parameter type-id='eb572b74'/>
        <parameter type-id='b88dd945'/>
        <parameter type-id='a42536cd'/>
        <parameter type-id='7292109c'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='686e5e33'>
        <parameter type-id='eb572b74'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='ec8e7b62'>
        <parameter type-id='eb572b74'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='af8a50f5'>
        <parameter type-id='4cb5819d'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='f680e13e'>
        <parameter type-id='f8dc9def'/>
        <parameter type-id='a970a64c'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='3cab519e'>
        <parameter type-id='db9d03e3'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='95e97e5e'/>
      </function-type>
      <function-type size-in-bits='64' id='32672900'>
        <parameter type-id='a47d3467'/>
        <parameter type-id='298d0a77'/>
        <return type-id='f4e2facd'/>
      </function-type>
      <function-type size-in-bits='64' id='c2be64d1'>
        <parameter type-id='a47d3467'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='06c81b64'>
        <parameter type-id='e7d2a5fc'/>
        <return type-id='b50a4934'/>
      </function-type>
      <function-type size-in-bits='64' id='4bbe36cb'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='89a2612a'/>
        <parameter type-id='26a90f95'/>
        <return type-id='79a0948f'/>
      </function-type>
      <function-type size-in-bits='64' id='50bd3cc7'>
        <parameter type-id='fa0b179b'/>
        <parameter type-id='89a2612a'/>
        <parameter type-id='80f4b756'/>
        <parameter type-id='b59d7dce'/>
        <return type-id='79a0948f'/>
      </function-type>
      <function-type size-in-bits='64' id='d7413fe5'>
        <parameter type-id='a970a64c'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='0457ac44'>
        <parameter type-id='a970a64c'/>
        <parameter type-id='1dc6a898'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='4e7ef9a4'>
        <parameter type-id='a47d3467'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='4f1e6b9a'>
        <parameter type-id='a47d3467'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='9d05a3e9'>
        <parameter type-id='cc26d15f'/>
        <parameter type-id='3dad1a48'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='45e743e9'>
        <parameter type-id='3dad1a48'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='57109d59'>
        <parameter type-id='0b8718c0'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='9102a0ad'>
        <parameter type-id='eb572b74'/>
        <return type-id='48b5725f'/>
      </function-type>
      <function-type size-in-bits='64' id='ed6fc6ea'>
        <parameter type-id='4cb5819d'/>
        <return type-id='48b5725f'/>
      </function-type>
    </abi-instr>
    <abi-instr version='1.0' address-size='64' path='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/fs/binfmt_misc.c' language='LANG_C89'>
      <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
      <array-type-def dimensions='1' type-id='3f1a6b60' size-in-bits='64' id='839e8989'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3f1a6b60' size-in-bits='96' id='3fa05d14'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='128' id='8a7b7524'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='1984' id='cb6b7280'>
        <subrange length='31' type-id='7ff19f0f' id='ae5e1d19'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='infinite' id='52cd3f2c'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='128' id='9396cabb'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='24' id='c216126b'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7e2609cc' size-in-bits='4096' id='98f84070'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='256' id='b6b7435e'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='49178f86' size-in-bits='288' id='32e5d672'>
        <subrange length='9' type-id='7ff19f0f' id='12e4273c'/>
      </array-type-def>
      <type-decl name='bool' size-in-bits='8' id='c894953d'/>
      <array-type-def dimensions='1' type-id='531c24d0' size-in-bits='128' id='dcd9fb4c'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='380c7edc' size-in-bits='1472' id='47645c1d'>
        <subrange length='23' type-id='7ff19f0f' id='fdd0f594'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f67e137c' size-in-bits='infinite' id='3f814540'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='162c1c01' size-in-bits='256' id='68694f49'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='cfff5953' size-in-bits='384' id='7975e215'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <type-decl name='char' size-in-bits='8' id='a84c031d'/>
      <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='2048' id='2e646d82'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='192' id='461c9ed2'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='512' id='460b55b1'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='128' id='ac1fa8c0'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16384' id='41bf80f3'>
        <subrange length='2048' type-id='7ff19f0f' id='e5323efb'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
        <subrange length='256' type-id='7ff19f0f' id='36e5b9fa'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
        <subrange length='4096' type-id='7ff19f0f' id='bc1b5ddc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='448' id='6093ff7c'>
        <subrange length='56' type-id='7ff19f0f' id='f8137894'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='48' id='4a008bc3'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' id='8e100159'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='infinite' id='e84913bd'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <class-decl name='acpi_device_id' size-in-bits='256' is-struct='yes' visibility='default' is-declaration-only='yes' id='ad95e21b'/>
      <class-decl name='anon_vma' is-struct='yes' visibility='default' is-declaration-only='yes' id='14f332cc'/>
      <class-decl name='assoc_array_ptr' is-struct='yes' visibility='default' is-declaration-only='yes' id='3249e303'/>
      <class-decl name='audit_context' is-struct='yes' visibility='default' is-declaration-only='yes' id='82d9d5d4'/>
      <class-decl name='audit_names' is-struct='yes' visibility='default' is-declaration-only='yes' id='90177497'/>
      <class-decl name='backing_dev_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='c0badb3b'/>
      <class-decl name='bdi_writeback' size-in-bits='6080' is-struct='yes' visibility='default' is-declaration-only='yes' id='ac0aeb1d'/>
      <class-decl name='bio_list' is-struct='yes' visibility='default' is-declaration-only='yes' id='096280be'/>
      <class-decl name='bio_vec' size-in-bits='128' is-struct='yes' visibility='default' is-declaration-only='yes' id='40af3608'/>
      <class-decl name='blk_plug' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='718a7cd9'/>
      <class-decl name='bpf_cgroup_storage_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='0ad68707'/>
      <class-decl name='bpf_prog' is-struct='yes' visibility='default' is-declaration-only='yes' id='facd5338'/>
      <class-decl name='capture_control' size-in-bits='128' is-struct='yes' visibility='default' is-declaration-only='yes' id='978e8e27'/>
      <class-decl name='cdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='22f86351'/>
      <class-decl name='cgroup_taskset' is-struct='yes' visibility='default' is-declaration-only='yes' id='19596889'/>
      <class-decl name='cma' is-struct='yes' visibility='default' is-declaration-only='yes' id='6110442c'/>
      <class-decl name='dev_pin_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='038d05bd'/>
      <class-decl name='dev_pm_qos' size-in-bits='2560' is-struct='yes' visibility='default' is-declaration-only='yes' id='7d93f824'/>
      <class-decl name='device_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='6661a698'/>
      <class-decl name='device_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='d066d157'/>
      <class-decl name='dma_coherent_mem' is-struct='yes' visibility='default' is-declaration-only='yes' id='5d5ff7f6'/>
      <class-decl name='dma_map_ops' size-in-bits='1472' is-struct='yes' visibility='default' is-declaration-only='yes' id='d45f2b4f'/>
      <class-decl name='driver_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='e44b8083'/>
      <class-decl name='event_filter' is-struct='yes' visibility='default' is-declaration-only='yes' id='5ff1273a'/>
      <class-decl name='export_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='1a0c5572'/>
      <class-decl name='files_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='bccdf330'/>
      <class-decl name='fs_parameter_description' is-struct='yes' visibility='default' is-declaration-only='yes' id='8a2a988b'/>
      <class-decl name='fs_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='7dc87302'/>
      <class-decl name='fscrypt_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='9441bb37'/>
      <class-decl name='fscrypt_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='fa21a7e9'/>
      <class-decl name='fsnotify_mark_connector' is-struct='yes' visibility='default' is-declaration-only='yes' id='aadc8ce9'/>
      <class-decl name='fsverity_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='43489bca'/>
      <class-decl name='fsverity_operations' is-struct='yes' visibility='default' is-declaration-only='yes' id='5f0d764c'/>
      <class-decl name='futex_pi_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='62bd013f'/>
      <class-decl name='fwnode_handle' size-in-bits='448' is-struct='yes' visibility='default' is-declaration-only='yes' id='d5ace205'/>
      <class-decl name='gendisk' is-struct='yes' visibility='default' is-declaration-only='yes' id='4f60ffbc'/>
      <class-decl name='hd_struct' size-in-bits='9280' is-struct='yes' visibility='default' is-declaration-only='yes' id='2473bc1f'/>
      <class-decl name='iommu_fwspec' is-struct='yes' visibility='default' is-declaration-only='yes' id='0d6f83ff'/>
      <class-decl name='iommu_group' is-struct='yes' visibility='default' is-declaration-only='yes' id='2352f3ae'/>
      <class-decl name='iommu_ops' is-struct='yes' visibility='default' is-declaration-only='yes' id='8b7a2cd1'/>
      <class-decl name='iommu_param' is-struct='yes' visibility='default' is-declaration-only='yes' id='6c784694'/>
      <class-decl name='ipc_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='dd74f3ed'/>
      <class-decl name='irq_domain' size-in-bits='1408' is-struct='yes' visibility='default' is-declaration-only='yes' id='a667f60e'/>
      <class-decl name='kernfs_iattrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='7b5435ce'/>
      <class-decl name='kernfs_open_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='cc9b8e48'/>
      <class-decl name='key_type' is-struct='yes' visibility='default' is-declaration-only='yes' id='71e87d49'/>
      <class-decl name='key_user' is-struct='yes' visibility='default' is-declaration-only='yes' id='696d238e'/>
      <class-decl name='kioctx_table' is-struct='yes' visibility='default' is-declaration-only='yes' id='5d0f15d4'/>
      <class-decl name='kmem_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='a3119fea'/>
      <class-decl name='kstatfs' is-struct='yes' visibility='default' is-declaration-only='yes' id='ff1c7c9b'/>
      <class-decl name='mem_cgroup' size-in-bits='22528' is-struct='yes' visibility='default' is-declaration-only='yes' id='11c8601b'/>
      <class-decl name='mnt_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='de031042'/>
      <class-decl name='module_notes_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='96b6b914'/>
      <class-decl name='module_param_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='9e045430'/>
      <class-decl name='module_sect_attrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='b43b0dce'/>
      <class-decl name='mtd_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='25dc4075'/>
      <class-decl name='nameidata' is-struct='yes' visibility='default' is-declaration-only='yes' id='0319fc05'/>
      <class-decl name='net' is-struct='yes' visibility='default' is-declaration-only='yes' id='bd965180'/>
      <class-decl name='nfs4_lock_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='a558a366'/>
      <class-decl name='nlm_lockowner' is-struct='yes' visibility='default' is-declaration-only='yes' id='92afe5f3'/>
      <class-decl name='of_device_id' size-in-bits='1600' is-struct='yes' visibility='default' is-declaration-only='yes' id='8bb45a31'/>
      <class-decl name='pipe_inode_info' size-in-bits='1088' is-struct='yes' visibility='default' is-declaration-only='yes' id='bed94322'/>
      <class-decl name='pm_domain_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='3bf19710'/>
      <class-decl name='posix_acl' is-struct='yes' visibility='default' is-declaration-only='yes' id='605b61bb'/>
      <class-decl name='proc_ns_operations' size-in-bits='512' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ba71bf0'/>
      <class-decl name='rcu_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='67b24a02'/>
      <class-decl name='reclaim_state' size-in-bits='64' is-struct='yes' visibility='default' is-declaration-only='yes' id='b9b792e2'/>
      <class-decl name='request_queue' is-struct='yes' visibility='default' is-declaration-only='yes' id='caf652c6'/>
      <class-decl name='ring_buffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='6efee8be'/>
      <class-decl name='ring_buffer_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='563595d9'/>
      <class-decl name='robust_list_head' is-struct='yes' visibility='default' is-declaration-only='yes' id='999b38a0'/>
      <class-decl name='rt_mutex_waiter' is-struct='yes' visibility='default' is-declaration-only='yes' id='afb04a62'/>
      <class-decl name='sched_class' size-in-bits='1600' is-struct='yes' visibility='default' is-declaration-only='yes' id='74191d27'/>
      <class-decl name='seccomp_filter' is-struct='yes' visibility='default' is-declaration-only='yes' id='e290c28c'/>
      <class-decl name='sock' is-struct='yes' visibility='default' is-declaration-only='yes' id='a240f41d'/>
      <class-decl name='static_key_mod' is-struct='yes' visibility='default' is-declaration-only='yes' id='5081ed08'/>
      <class-decl name='subsys_private' is-struct='yes' visibility='default' is-declaration-only='yes' id='4a19d21e'/>
      <class-decl name='swap_info_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='3eb82749'/>
      <class-decl name='task_group' size-in-bits='3008' is-struct='yes' visibility='default' is-declaration-only='yes' id='2d863538'/>
      <class-decl name='trace_array' is-struct='yes' visibility='default' is-declaration-only='yes' id='e27b4e90'/>
      <class-decl name='trace_buffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='72093c11'/>
      <class-decl name='tracer' is-struct='yes' visibility='default' is-declaration-only='yes' id='fd1f8b7c'/>
      <class-decl name='tty_audit_buf' is-struct='yes' visibility='default' is-declaration-only='yes' id='9127cd0e'/>
      <class-decl name='tty_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='4c8d9cac'/>
      <class-decl name='unicode_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='a24978a1'/>
      <class-decl name='uprobe' is-struct='yes' visibility='default' is-declaration-only='yes' id='b7e0fed2'/>
      <class-decl name='uts_namespace' is-struct='yes' visibility='default' is-declaration-only='yes' id='44f52e9d'/>
      <class-decl name='vm_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='5f2f8da4'/>
      <class-decl name='wake_irq' size-in-bits='192' is-struct='yes' visibility='default' is-declaration-only='yes' id='4657336c'/>
      <class-decl name='workqueue_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='a5159c01'/>
      <class-decl name='writeback_control' is-struct='yes' visibility='default' is-declaration-only='yes' id='705711f5'/>
      <class-decl name='xattr_handler' is-struct='yes' visibility='default' is-declaration-only='yes' id='2d3dd5e3'/>
      <class-decl name='xol_area' is-struct='yes' visibility='default' is-declaration-only='yes' id='c39df2b8'/>
      <array-type-def dimensions='1' type-id='9b45d938' size-in-bits='infinite' id='0904d1cc'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='bd561d05' size-in-bits='192' id='59bd9302'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='47841236' size-in-bits='256' id='bb2d0d4e'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='1354385d' size-in-bits='64' id='db98c084'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e151255a' size-in-bits='256' id='fc3a8480'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='03a4a074' size-in-bits='512' id='3f6e320a'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='1851ab9f' size-in-bits='4096' id='cb01bf4b'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7e666abe' size-in-bits='192' id='e6ff92fb'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
      <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='128' id='2020bac4'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='288' id='e415235d'>
        <subrange length='9' type-id='7ff19f0f' id='12e4273c'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='infinite' id='1fdc7fa6'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a21c4412' size-in-bits='16384' id='02d77f24'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='094d8048' size-in-bits='infinite' id='da6e2919'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='2944' id='a835e1f5'>
        <subrange length='23' type-id='7ff19f0f' id='fdd0f594'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='768' id='e4e6d6c4'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f6507b0a' size-in-bits='infinite' id='b969bd7a'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='47479831' id='9c02e2a6'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
      <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
      <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
      <array-type-def dimensions='1' type-id='b0690d78' size-in-bits='1728' id='83ae09a1'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='ce848ab1' size-in-bits='2880' id='a09ef5a6'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='c25adaa0' size-in-bits='infinite' id='6b9809bc'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='2bf16f59' size-in-bits='1024' id='18b1b6ec'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='b9419dc5' size-in-bits='128' id='c7e7059f'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='b94e5398' size-in-bits='256' id='3449295e'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e710f78e' size-in-bits='576' id='0e685653'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e878d564' size-in-bits='1344' id='55d1e02d'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='2a8a6332' size-in-bits='384' id='d46544fa'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='60dcbf6c' size-in-bits='2048' id='80f344e1'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <type-decl name='short int' size-in-bits='16' id='a2185560'/>
      <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
      <array-type-def dimensions='1' type-id='8dee6d89' size-in-bits='192' id='2f7565c6'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='56798c81' size-in-bits='2304' id='01115b96'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='736' id='bd44dad8'>
        <subrange length='23' type-id='7ff19f0f' id='fdd0f594'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='19c2251e' size-in-bits='384' id='4e00dfcd'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='160' id='586ea944'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='192' id='5867ed7f'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='128' id='24a375b2'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='91ce1af9' size-in-bits='640' id='a4295685'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='1984' id='2f7ab612'>
        <subrange length='31' type-id='7ff19f0f' id='ae5e1d19'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='192' id='20a130cf'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='320' id='64af1365'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='24' id='930ea9f9'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='0888126c' size-in-bits='64' id='c6e3c250'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a9d71093' size-in-bits='480' id='df6d2206'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='6406df84'/>
      <type-decl name='unsigned __int128' size-in-bits='128' id='4f340252'/>
      <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
      <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='256' id='fc872715'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='32768' id='0622cd17'>
        <subrange length='4096' type-id='7ff19f0f' id='bc1b5ddc'/>
      </array-type-def>
      <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
      <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='96' id='0955670c'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='64' id='f066dd3c'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='128' id='f05e8e77'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='2944' id='d964a553'>
        <subrange length='46' type-id='7ff19f0f' id='8b86bc1b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='256' id='f46d9f4d'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='7359adad' size-in-bits='960' id='625e8699'>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='7359adad' size-in-bits='infinite' id='c99b5ecd'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
      <array-type-def dimensions='1' type-id='120c01b5' size-in-bits='128' id='9a69aeec'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='2ae08426' size-in-bits='256' id='ae25b7bc'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <type-decl name='void' id='48b5725f'/>
      <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='256' id='209ef23f'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <class-decl name='file' size-in-bits='2176' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='956' column='1' id='b4b8adeb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='f_u' type-id='ac5ab596' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='960' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='f_path' type-id='b5382ece' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='961' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='f_inode' type-id='7e666abe' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='962' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='f_op' type-id='61758ee5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='963' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='f_lock' type-id='fb4018a0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='969' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='f_write_hint' type-id='0d20c3dd' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='970' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='f_count' type-id='f22a8abb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='971' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='f_flags' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='972' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='544'>
          <var-decl name='f_mode' type-id='2665334e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='973' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='f_pos_lock' type-id='925167dc' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='974' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='f_pos' type-id='69bf7bee' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='975' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='f_owner' type-id='6b640edd' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='976' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='f_cred' type-id='bc33861b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='977' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='f_ra' type-id='b31f003f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='978' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='f_version' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='980' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='f_security' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='982' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='private_data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='985' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='f_ep_links' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='989' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='f_tfile_llink' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='990' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='f_mapping' type-id='f57039f0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='992' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='f_wb_err' type-id='1da55f79' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='993' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='995' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='android_vendor_data1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='996' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='llist_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/llist.h' line='58' column='1' id='c5ccfee8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='023b769e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/llist.h' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='callback_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='219' column='1' id='e3d8ce29'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='69c138b1' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='220' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='func' type-id='eb839374' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='221' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='path' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/path.h' line='8' column='1' id='b5382ece'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mnt' type-id='549da823' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/path.h' line='9' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='dentry' type-id='27675065' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/path.h' line='10' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='vfsmount' size-in-bits='512' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='69' column='1' id='19e88833'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='mnt_root' type-id='27675065' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='70' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mnt_sb' type-id='42c8f564' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='71' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='mnt_flags' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/mount.h' line='77' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='dentry' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='90' column='1' id='d6ebca75'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='d_flags' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='92' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='d_seq' type-id='e14c3b11' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='93' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='d_hash' type-id='8db0df1b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='94' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='d_parent' type-id='27675065' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='95' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='d_name' type-id='02244303' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='d_inode' type-id='7e666abe' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='d_iname' type-id='fc872715' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='d_lockref' type-id='60efdfd3' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='d_op' type-id='1ee57353' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='103' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='d_sb' type-id='42c8f564' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='d_time' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='105' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='d_fsdata' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='' type-id='1404f87e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='d_child' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='112' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='d_subdirs' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='d_u' type-id='0702a570' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='124' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='seqcount_t' type-id='3a74ff0b' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/seqlock.h' line='53' column='1' id='e14c3b11'/>
      <class-decl name='seqcount' size-in-bits='32' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/seqlock.h' line='48' column='1' id='3a74ff0b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='sequence' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/seqlock.h' line='49' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hlist_bl_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/list_bl.h' line='38' column='1' id='8db0df1b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='next' type-id='d09d4bab' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/list_bl.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pprev' type-id='e89ddc13' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/list_bl.h' line='39' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='qstr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='48' column='1' id='02244303'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='f6cbf12d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='name' type-id='354f7eb9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='55' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='49' column='1' id='f6cbf12d'>
        <data-member access='private'>
          <var-decl name='' type-id='e7f43f73' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='50' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='hash_len' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='53' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='50' column='1' id='e7f43f73'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='hash' type-id='19c2251e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='len' type-id='19c2251e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/dcache.h' line='51' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='u32' type-id='3f1a6b60' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/asm-generic/int-ll64.h' line='21' column='1' id='19c2251e'/>
      <typedef-decl name='__u32' type-id='f0981eeb' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/asm-generic/int-ll64.h' line='27' column='1' id='3f1a6b60'/>
      <typedef-decl name='u64' type-id='d3130597' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/asm-generic/int-ll64.h' line='23' column='1' id='91ce1af9'/>
      <typedef-decl name='__u64' type-id='3a47d82b' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/asm-generic/int-ll64.h' line='31' column='1' id='d3130597'/>
      <class-decl name='inode' size-in-bits='5312' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='645' column='1' id='fe070fe8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='i_mode' type-id='2594b00f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='646' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='i_opflags' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='647' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='i_uid' type-id='d80b72e6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='648' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='i_gid' type-id='094d8048' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='649' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='i_flags' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='650' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='i_acl' type-id='2871909b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='653' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='i_default_acl' type-id='2871909b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='654' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='i_op' type-id='de2c232c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='657' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='i_sb' type-id='42c8f564' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='658' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='i_mapping' type-id='f57039f0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='659' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='i_security' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='662' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='i_ino' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='666' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='' type-id='0a04e8c0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='674' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='608'>
          <var-decl name='i_rdev' type-id='8504f260' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='678' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='i_size' type-id='69bf7bee' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='679' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='i_atime' type-id='40a816ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='680' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='i_mtime' type-id='40a816ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='681' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='i_ctime' type-id='40a816ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='682' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='i_lock' type-id='fb4018a0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='683' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1120'>
          <var-decl name='i_bytes' type-id='8efea9e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='684' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1136'>
          <var-decl name='i_blkbits' type-id='f9b06939' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='685' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1144'>
          <var-decl name='i_write_hint' type-id='f9b06939' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='686' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='i_blocks' type-id='17345459' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='687' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='i_state' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='694' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='i_rwsem' type-id='f19fdb93' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='695' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='dirtied_when' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='697' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='dirtied_time_when' type-id='7359adad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='698' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='i_hash' type-id='03a4a074' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='700' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='i_io_list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='701' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='i_wb' type-id='f885ca7d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='703' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='i_wb_frn_winner' type-id='95e97e5e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='706' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2144'>
          <var-decl name='i_wb_frn_avg_time' type-id='1dc6a898' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='707' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2160'>
          <var-decl name='i_wb_frn_history' type-id='1dc6a898' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='708' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='i_lru' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='710' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='i_sb_list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='711' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='i_wb_list' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='712' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='' type-id='1104f3c5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='713' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='i_version' type-id='28ee064c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='717' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='i_sequence' type-id='28ee064c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='718' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='i_count' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='719' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2848'>
          <var-decl name='i_dio_count' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='720' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='i_writecount' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='721' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2912'>
          <var-decl name='i_readcount' type-id='49178f86' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='723' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='' type-id='1004f232' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='725' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='i_flctx' type-id='731257ff' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='729' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='i_data' type-id='0fd82dc2' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='730' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4672'>
          <var-decl name='i_devices' type-id='72f469ec' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='731' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4800'>
          <var-decl name='' type-id='0e04ef0c' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='732' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4864'>
          <var-decl name='i_generation' type-id='3f1a6b60' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='740' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4896'>
          <var-decl name='i_fsnotify_mask' type-id='3f1a6b60' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='743' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4928'>
          <var-decl name='i_fsnotify_marks' type-id='994d9d61' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='744' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4992'>
          <var-decl name='i_crypt_info' type-id='1ea8c5af' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='748' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5056'>
          <var-decl name='i_verity_info' type-id='ba18e248' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='752' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5120'>
          <var-decl name='i_private' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='755' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5184'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='757' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5248'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='758' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='umode_t' type-id='8efea9e5' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='19' column='1' id='2594b00f'/>
      <typedef-decl name='kuid_t' type-id='481a8ccb' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/uidgid.h' line='23' column='1' id='d80b72e6'/>
      <class-decl name='__anonymous_struct__1' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='d80b72e6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/uidgid.h' line='21' column='1' id='481a8ccb'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val' type-id='354978ed' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/uidgid.h' line='22' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='rcu_special' size-in-bits='32' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sched.h' line='777' column='1' id='a324790e'>
        <data-member access='private'>
          <var-decl name='b' type-id='bdd2c642' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sched.h' line='783' column='1'/>
        </data-member>
        <data-member access='private'>
          <var-decl name='s' type-id='19c2251e' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/sched.h' line='784' column='1'/>
        </data-member>
      </union-decl>
      <typedef-decl name='uid_t' type-id='70734f24' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='32' column='1' id='354978ed'/>
      <typedef-decl name='__kernel_uid32_t' type-id='f0981eeb' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/asm-generic/posix_types.h' line='49' column='1' id='70734f24'/>
      <typedef-decl name='kgid_t' type-id='9a93b9b9' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/uidgid.h' line='28' column='1' id='094d8048'/>
      <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='094d8048' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/uidgid.h' line='26' column='1' id='9a93b9b9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val' type-id='2bb2b96f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/uidgid.h' line='27' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='gid_t' type-id='b4413cee' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='33' column='1' id='2bb2b96f'/>
      <typedef-decl name='__kernel_gid32_t' type-id='f0981eeb' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/asm-generic/posix_types.h' line='50' column='1' id='b4413cee'/>
      <class-decl name='inode_operations' size-in-bits='2048' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1917' column='1' id='5f5aa1ff'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lookup' type-id='02f90a61' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1918' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='get_link' type-id='76ae8e1d' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1919' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='permission' type-id='f4f91b99' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1920' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='get_acl' type-id='7f30b822' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1921' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='readlink' type-id='a57bd028' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1923' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='create' type-id='c9cd0e09' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1925' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='link' type-id='4b872e00' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1926' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='unlink' type-id='7f5be7f6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1927' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='symlink' type-id='234843b5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1928' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='mkdir' type-id='98c2d938' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1929' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='rmdir' type-id='7f5be7f6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1930' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='mknod' type-id='f9e0c0e5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1931' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='rename' type-id='7733ef81' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1932' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='setattr' type-id='c237e829' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1934' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='getattr' type-id='0b787edf' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1935' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='listxattr' type-id='3494e4bb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1936' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='fiemap' type-id='0508acce' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1937' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='update_time' type-id='64ecf6a5' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1939' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='atomic_open' type-id='d3807eb0' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1940' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='tmpfile' type-id='98c2d938' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1943' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='set_acl' type-id='820976ef' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1944' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1946' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1947' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='android_kabi_reserved3' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1948' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='android_kabi_reserved4' type-id='91ce1af9' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='1949' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='delayed_call' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/delayed_call.h' line='10' column='1' id='f1fbc58e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='fn' type-id='b7f9d8e6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/delayed_call.h' line='11' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='arg' type-id='eaa32e2f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/delayed_call.h' line='12' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='bool' type-id='c894953d' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='30' column='1' id='b50a4934'/>
      <typedef-decl name='dev_t' type-id='8f336000' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='16' column='1' id='8504f260'/>
      <typedef-decl name='__kernel_dev_t' type-id='19c2251e' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='13' column='1' id='8f336000'/>
      <class-decl name='iattr' size-in-bits='640' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='226' column='1' id='a9ef191f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='ia_valid' type-id='f0981eeb' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='227' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='ia_mode' type-id='2594b00f' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='228' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ia_uid' type-id='d80b72e6' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='229' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='ia_gid' type-id='094d8048' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='230' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ia_size' type-id='69bf7bee' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='231' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='ia_atime' type-id='40a816ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='232' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='ia_mtime' type-id='40a816ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='233' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='ia_ctime' type-id='40a816ad' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='234' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='ia_file' type-id='77e79a4b' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/fs.h' line='241' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='loff_t' type-id='537a730e' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/types.h' line='46' column='1' id='69bf7bee'/>
      <typedef-decl name='__kernel_loff_t' type-id='1eb56b1e' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/asm-generic/posix_types.h' line='88' column='1' id='537a730e'/>
      <class-decl name='timespec64' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/time64.h' line='13' column='1' id='40a816ad'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tv_sec' type-id='1afd27ac' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/time64.h' line='14' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='tv_nsec' type-id='bd54fe1a' visibility='default' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/time64.h' line='15' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='time64_t' type-id='49659421' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/linux/time64.h' line='8' column='1' id='1afd27ac'/>
      <typedef-decl name='__s64' type-id='1eb56b1e' filepath='/opt/workspace/gphone/SM6375/PD2165/ap_systemtest/kernel/msm-5.4/include/uapi/asm-generic/int-ll64.h' line='30' column='1' id='49659421'/>
